'''Створіть клас під назвою Counter і зробіть його підкласом класу Thread в модулі Threading.
 Зробіть у класі дві глобальні змінні, одна з яких має значення 0, а інша - 100000.
  Тепер реалізуйте метод run (),
  нехай він включає простий цикл for, який перебирає раунди (тобто 100 000 разів)
  і для кожного часу збільшує значення лічильника на 1.
   Створіть 2 екземпляри потоку та запустіть їх,
    а потім приєднайтеся їх і перевірити результат лічильника, він повинен бути 200 000, так?
     Запустіть пару разів і розгляньте кілька різних причин, чому ви отримаєте відповідь, яку отримаєте.
'''
from threading import Thread


class Counter(Thread):

    counter_set = 0
    rounds_set = 100000

    def run(self):
        for i in range(Counter.rounds_set):
            Counter.counter_set+=1

if __name__ == '__main__':
        t1=Counter()
        t2 =Counter()

        t1.start()
        t2.start()
        t1.join()
        t2.join()
        print(t1.counter_set)
        print(t2.counter_set)